import React from "react";
import useStyles from "./style";

const Goverment: React.FC = () => {
  const classes: any = useStyles();

  return (
    <div className={classes.root}>
      <div className={classes.containerInfo}>
        Місто Жовква було закладене в 1597 р. на землях давньоруського поселення
        Винники, неподалік древнього міста Щекотів (Щекотин, тепер село Глинсько
        Жовківського району), яке згадувалося у Галицько-Волинському літописі у
        1242 р.
        <p>
          Перша згадка в літописах про село Винники датується 1368 роком.
          Винники лежали на межі Звенигородського та Белзького князівств, через
          територію яких пролягли торгові шляхи з Галича та Львова на Белз,
          Холм. Розташування поселення на торговій дорозі сприяло його швидкому
          розвитку. Після розпаду Руського Королівства (Галицько-Волинського
          князівства) і захоплення його земель Польщею наприкінці XVI століття
          (1588 р.) Винники перейшли у власність гетьмана Станіслава
          Жолкевського, який згодом одержав королівський привілей Зиґмунта III
          Вази на будівництво нового міста та на право назвати нове місто
          Жовквою (1603 р.).
        </p>
        З наданням Жовкві 22 лютого 1603 р. грамотою короля Сигізмунда ІІІ Вази
        магдебурзького права пожвавилося економічне життя міста й околиць,
        швидше стали розвиватися ремесла й торгівля. Урядування в місті
        здійснював магістрат, який обирався за згодою власника міста.
        <p>
          Для будівництва міста Жовкви була вибрана вигідна в оборонному
          відношенні, вільна від житлової забудови підвищена платформа, де
          перетиналися важливі шляхи Червоної Русі. Припускають, що гетьман С.
          Жолкевський із дружиною хотіли бачити розпланування Жовкви за взірцем
          «Ідеальних міст» італійського архітектора П'єтро Катанео. Планування
          здійснив Павло Щасливий, який тоді зводив замок, а після нього костел
          св. Лаврентія. В першій половині XVII ст. Жовква перетворилася на
          укріплене місто-фортецю, оточене валами та ровами. Ринкову площу,
          розплановану перед замком, з північного та східного боків оточили
          житлові кам'яниці з відкритими галереями-підсінням. Припускають, що
          своєю красою Жовква має завдячувати дружині гетьмана Реґіні, котра
          дбала про місто, у той час коли чоловік перебував на королівській
          службі. Після Жолкевських місто належало родині Даниловичів, далі по
          матері Софії Теофілії — Янові ІІІ Собєському. В XIX столітті в
          Златополі у пана Владислава Ясенецького зберігався сімейний портрет
          Теофіли з синами Марком та Яном на молитві у костелі міста Жовква.
        </p>
        З 1678 року Жовківський замок став королівською резиденцією Яна III
        Собеського. У II пол. XVII — на початку XVIII ст. місто досконало
        розбудувалося, отримало низку нових кам'яних будівель, прекрасні
        садово-паркові ансамблі й досягло свого найвищого розвитку і багатства.
        У Жовкві діяли п'ять церков, чотири костели, синагога. Славилась високою
        художньою цінністю жовківська збірка живопису, графіки, різьблення,
        гобеленів, порцеляни, зброї. Прославили місто іконописці та різьбярі
        Жовківського мистецького осередку кінця XVII — поч. XVIII ст.
        <p>
          Оборонний мур та Глинська брама. Дослідник історії Жовкви вірменин
          Садок Баронч висунув версію про народження тут українського державного
          діяча і полководця, гетьмана Богдана Хмельницького. Під час визвольної
          війни українського народу під проводом Богдана Хмельницького у Жовкві
          двічі побувало козацько-селянське військо. Під час Північної війни
          1700—1721 рр. Жовківський замок з грудня 1706 р. до квітня 1707 р.
          став резиденцією російського царя Петра I. Згідно з легендою, місцева
          річка Свиня здобула свою назву після того, як туди впав московський
          цар (перед тим випив надто багато алкоголю).
        </p>
        До Жовкви у квітні 1707 року приїздив український гетьман Іван Мазепа. З
        Жовкви гетьман відправляв посланця до Саксонії заручитись підтримкою
        шведського короля Карла XII.
        <p>
          Кароль Юзеф Сопіга восени 1745 року пробував бути посередником в
          суперечці між гетьманом литовським Михайлом Казимиром Радзивіллом
          «Рибонькою» та сандомирським воєводою Яном Тарлом в їх суперечці через
          права на Жовкву.
        </p>
      </div>
    </div>
  );
};

export default Goverment;
